{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "NFKC"
  },
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<s>": 0,
      "<pad>": 1,
      "</s>": 2,
      "<unk>": 3,
      "<mask>": 4,
      "_": 5,
      "a": 6,
      "c": 7,
      "d": 8,
      "e": 9,
      "g": 10,
      "h": 11,
      "i": 12,
      "l": 13,
      "m": 14,
      "n": 15,
      "o": 16,
      "p": 17,
      "r": 18,
      "s": 19,
      "t": 20,
      "u": 21,
      "x": 22,
      "y": 23,
      "Ġ": 24,
      "ti": 25,
      "ex": 26,
      "ai": 27,
      "er": 28,
      "me": 29,
      "st": 30,
      "tex": 31,
      "Ġd": 32,
      "Ġp": 33,
      "Ġtex": 34,
      "tio": 35,
      "Ġtext": 36,
      "am": 37,
      "atio": 38,
      "cl": 39,
      "en": 40,
      "ep": 41,
      "eti": 42,
      "gt": 43,
      "it": 44,
      "lex": 45,
      "len": 46,
      "mai": 47,
      "ns": 48,
      "omai": 49,
      "plex": 50,
      "rl": 51,
      "rs": 52,
      "ratio": 53,
      "rep": 54,
      "ta": 55,
      "up": 56,
      "ust": 57,
      "url": 58,
      "Ġti": 59,
      "Ġme": 60,
      "Ġcl": 61,
      "Ġrep": 62,
      "Ġurl": 63,
      "airs": 64,
      "erplex": 65,
      "mest": 66,
      "Ġdomai": 67,
      "Ġdup": 68,
      "Ġpairs": 69,
      "Ġperplex": 70,
      "tions": 71,
      "amp": 72,
      "etitions": 73,
      "gth": 74,
      "ity": 75,
      "length": 76,
      "uster": 77,
      "Ġtimest": 78,
      "Ġmeta": 79,
      "Ġcluster": 80,
      "Ġrepetitions": 81,
      "Ġdomain": 82,
      "Ġperplexity": 83,
      "Ġtimestamp": 84
    },
    "merges": [
      "t i",
      "e x",
      "a i",
      "e r",
      "m e",
      "s t",
      "t ex",
      "Ġ d",
      "Ġ p",
      "Ġ tex",
      "ti o",
      "Ġtex t",
      "a m",
      "a tio",
      "c l",
      "e n",
      "e p",
      "e ti",
      "g t",
      "i t",
      "l ex",
      "l en",
      "m ai",
      "n s",
      "o mai",
      "p lex",
      "r l",
      "r s",
      "r atio",
      "r ep",
      "t a",
      "u p",
      "u st",
      "u rl",
      "Ġ ti",
      "Ġ me",
      "Ġ cl",
      "Ġ rep",
      "Ġ url",
      "ai rs",
      "er plex",
      "me st",
      "Ġd omai",
      "Ġd up",
      "Ġp airs",
      "Ġp erplex",
      "tio ns",
      "am p",
      "eti tions",
      "gt h",
      "it y",
      "len gth",
      "ust er",
      "Ġti mest",
      "Ġme ta",
      "Ġcl uster",
      "Ġrep etitions",
      "Ġdomai n",
      "Ġperplex ity",
      "Ġtimest amp"
    ]
  }
}